# TopRailType Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
TopRailType Class
Members See Also
---
A rail type object that is used in the generation of top rail.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class TopRailType : ContinuousRailType
```

Visual Basic
---
```text
Public Class TopRailType _
	Inherits ContinuousRailType
```

Visual C++
---
```text
public ref class TopRailType : public ContinuousRailType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB.Architecture..::..ContinuousRailType Autodesk.Revit.DB.Architecture..::..TopRailType
# See Also
TopRailType Members
Autodesk.Revit.DB.Architecture Namespace